Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/tutorial-5/android.po
Languages: de, zh_cn

source: Tutorial 5 - Taking it mobile: Android
de: Tutorial 5 - Mobiles Arbeiten: Android
zh_cn: 教程 5 - 在移动设备上：安卓

source: Now, we're going to take our application, and deploy it as an Android application.
de: Jetzt nehmen wir unsere Anwendung und stellen sie als Android-Anwendung bereit.
zh_cn: 现在，我们要将应用程序部署为 Android 应用程序。

source: The process of deploying an application to Android is very similar to the process for deploying as a desktop application. Briefcase handles installing dependencies for Android, including the Android SDK, the Android emulator, and a Java compiler.
de: Der Prozess der Bereitstellung einer Anwendung für Android ist dem Prozess der Bereitstellung als Desktop-Anwendung sehr ähnlich. Briefcase übernimmt die Installation von Abhängigkeiten für Android, einschließlich des Android SDK, des Android-Emulators und eines Java-Compilers.
zh_cn: 将应用程序部署到 Android 的过程与部署为桌面应用程序的过程非常相似。Briefcase 会处理 Android 上的依赖项的安装，包括 Android SDK、Android 模拟器，和一个 Java 编译器。

source: Create an Android app and compile it
de: Eine Android-App erstellen und kompilieren
zh_cn: 创建并编译 Android 应用程序

source: First, run the ``create`` command. This downloads an Android app template and adds your Python code to it.
de: Zuerst führen Sie den Befehl ``create`` aus. Dies lädt eine Android-App-Vorlage herunter und fügt Ihren Python-Code hinzu.
zh_cn: 首先，运行 ``create`` 命令。这会下载一个 Android 应用程序模板，并在其中添加您的 Python 代码。

source: When you run ``briefcase create android`` for the first time, Briefcase downloads a Java JDK, and the Android SDK. File sizes and download times can be considerable; this may take a while (10 minutes or longer, depending on the speed of your Internet connection). When the download has completed, you will be prompted to accept Google's Android SDK license. There's a number of licenses you'll need to agree too - keep entering ``y`` at the prompt to review and accept each of the necessary the license agreements.
de: Wenn Sie ``briefcase create android`` zum ersten Mal ausführen, lädt Briefcase ein Java JDK und das Android SDK herunter. Die Dateigrößen und Downloadzeiten können beträchtlich sein; dies kann eine Weile dauern (10 Minuten oder länger, abhängig von der Geschwindigkeit Ihrer Internetverbindung). Wenn der Download abgeschlossen ist, werden Sie aufgefordert, die Android-SDK-Lizenz von Google zu akzeptieren.
zh_cn: 首次运行 ``briefcase create android`` 时，Briefcase 会下载 Java JDK 和 Android SDK。文件大小较大，且下载时间可能会较长（10 分钟或更长，取决于您的互联网连接速度）。下载完成后，您将会被提示接受 Google 的 Android SDK 许可证。还有一些需要同意的许可证 -- 在提示符不停的按 ``y`` 以查看与接受所有所需的许可证协议。

source: Once this completes, we'll have a ``build\helloworld\android\gradle`` directory in our project, which will contain an Android project with a Gradle build configuration. This project will contain your application code, and a support package containing the Python interpreter.
de: Sobald dies abgeschlossen ist, haben wir in unserem Projekt ein Verzeichnis ``build\helloworld\android\gradle``, das ein Android-Projekt mit einer Gradle-Build-Konfiguration enthält. Dieses Projekt enthält Ihren Anwendungscode und ein Support-Paket, das den Python-Interpreter enthält.
zh_cn: 完成后，我们的项目中就会有一个\ ``build/helloworld/android/gradle``\ 目录，其中包含一个带有 Gradle 构建配置的 Android 项目。这个项目将包含您的应用代码，以及一个包含 Python 解释器的支持包。

source: We can then use Briefcase's ``build`` command to compile this into an Android APK app file.
de: Wir können dann den Befehl ``build`` von Briefcase verwenden, um diese in eine Android APK App-Datei zu kompilieren.
zh_cn: 然后我们可以使用 Briefcase 的 ``build`` 命令将其编译为 Android APK 应用程序文件。

source: Gradle may look stuck
de: Gradle kann aussehen, als würde es stecken bleiben
zh_cn: Gradle 看起来卡住了

source: During the ``briefcase build android`` step, Gradle (the Android platform build tool) will print ``CONFIGURING: 100%``, and appear to be doing nothing. Don't worry, it's not stuck - it's downloading more Android SDK components. Depending on your Internet connection speed, this may take another 10 minutes (or longer). This lag should only happen the very first time you run ``build``; the tools are cached, and on your next build, the cached versions will be used.
de: Während des Schrittes ``briefcase build android`` gibt Gradle (das Werkzeug zur Erstellung der Android-Plattform) ``CONFIGURING: 100%`` aus und scheint nichts zu tun. Keine Sorge, es steckt nicht fest - es lädt weitere Android SDK Komponenten herunter. Je nach der Geschwindigkeit Ihrer Internetverbindung kann dies weitere 10 Minuten (oder länger) dauern. Diese Verzögerung sollte nur beim allerersten Mal auftreten, wenn Sie ``build`` ausführen; die Tools werden zwischengespeichert und beim nächsten Build werden die zwischengespeicherten Versionen verwendet.
zh_cn: 在 ``briefcase build android`` 步骤中，Gradle（Android 平台构建工具）会打印 \ ``CONFIGURING: 100%``，似乎什么也没做。别担心，这不是卡住了，而是在下载更多的 Android SDK 组件。根据您的网络连接速度，这可能还需要 10 分钟（或更长时间）。只有在第一次运行 ``build`` 时才会出现这种滞后现象；这些工具将会被缓存，下次构建时将使用缓存版本。

source: Run the app on a virtual device
de: Ausführen der Anwendung auf einem virtuellen Gerät
zh_cn: 在虚拟设备上运行应用程序

source: We're now ready to run our application. You can use Briefcase's ``run`` command to run the app on an Android device. Let's start by running on an Android emulator.
de: Wir sind nun bereit, unsere Anwendung zu starten. Sie können den Befehl ``run`` von Briefcase verwenden, um die Anwendung auf einem Android-Gerät auszuführen. Beginnen wir mit der Ausführung auf einem Android-Emulator.
zh_cn: 现在我们可以运行应用程序了。您可以使用 Briefcase 的 ``run`` 命令在 Android 设备上运行应用程序。让我们从在 Android 模拟器上运行开始。

source: To run your application, run ``briefcase run android``. When you do this, you'll be prompted with a list of devices that you could run the app on. The last item will always be an option to create a new Android emulator.
de: Um Ihre Anwendung auszuführen, starten Sie ``briefcase run android``. Daraufhin erhalten Sie eine Liste von Geräten, auf denen Sie die Anwendung ausführen können. Der letzte Punkt ist immer eine Option zum Erstellen eines neuen Android-Emulators.
zh_cn: 要运行应用程序，请运行 ``briefcase run android``。运行时，系统会提示你可以在哪些设备上运行应用程序。最后一项总会是创建新安卓模拟器的选项。

source: We can now choose our desired device. Select the "Create a new Android emulator" option, and accept the default choice for the device name (``beePhone``).
de: Nun können wir unser gewünschtes Gerät auswählen. Wählen Sie die Option "Einen neuen Android-Emulator erstellen" und akzeptieren Sie die Standardauswahl für den Gerätenamen (``beePhone``).
zh_cn: 现在我们可以选择想要的设备。选择 "Create a new Android emulator" 选项，并接受默认的设备名称（``beePhone``）。

source: Briefcase ``run`` will automatically boot the virtual device. When the device is booting, you will see the Android logo:
de: Briefcase ``run`` wird das virtuelle Gerät automatisch starten. Wenn das Gerät hochfährt, sehen Sie das Android-Logo:
zh_cn: Briefcase ``run`` 将自动启动虚拟设备。设备启动时，您将看到 Android 徽标：

source: Android virtual device booting
de: Booten eines virtuellen Android-Geräts
zh_cn: 启动安卓虚拟设备

source: Once the device has finished booting, Briefcase will install your app on the device. You will briefly see a launcher screen:
de: Sobald das Gerät hochgefahren ist, wird Briefcase Ihre Anwendung auf dem Gerät installieren. Sie sehen kurz einen Startbildschirm:
zh_cn: 设备启动完成后，Briefcase 将在设备上安装您的应用程序。您将短暂看到一个启动页面：

source: Android virtual device fully started, on the launcher screen
de: Virtuelles Android-Gerät vollständig gestartet, auf dem Startbildschirm
zh_cn: 安卓虚拟设备已完全启动，显示在启动界面上

source: The app will then start. You'll see a splash screen while the app starts up:
de: Die Anwendung wird dann gestartet. Während die App startet, wird ein Begrüßungsbildschirm angezeigt:
zh_cn: 然后，应用程序就会启动。程序启动时，你会看到一个闪屏：

source: App splash screen
de: App-Startbildschirm
zh_cn: 应用程序启动页

source: The emulator didn't start!
de: Der Emulator ist nicht gestartet!
zh_cn: 模拟器没有启动！

source: The Android emulator is a complex piece of software that relies on a number of hardware and operating system features - features that may not be available or enabled on older machines. If you experience any difficulties starting the Android emulator, consult the `Requirements and recommendations <https://developer.android.com/studio/run/emulator#requirements>`__ section of the Android developer documentation.
de: Der Android-Emulator ist eine komplexe Software, die auf eine Reihe von Hardware- und Betriebssystemfunktionen angewiesen ist - Funktionen, die auf älteren Rechnern möglicherweise nicht verfügbar oder aktiviert sind. Wenn Sie Schwierigkeiten beim Starten des Android-Emulators haben, lesen Sie den Abschnitt "Anforderungen und Empfehlungen <https://developer.android.com/studio/run/emulator#requirements>" in der Android-Entwicklerdokumentation.
zh_cn: 安卓模拟器是一个复杂的软件，依赖于许多硬件和操作系统功能，这些功能在旧机器上可能无法使用或启用。如果在启动 Android 模拟器时遇到任何困难，请查阅 Android 开发人员文档中的\ `要求和建议 <https://developer.android.com/studio/run/emulator#requirements>`__\ 部分。

source: The first time the app starts, it needs to unpack itself onto the device. This may take a few seconds. Once it's unpacked, you'll see the Android version of our desktop app:
de: Wenn die App zum ersten Mal gestartet wird, muss sie sich auf dem Gerät entpacken. Das kann ein paar Sekunden dauern. Sobald sie entpackt ist, sehen Sie die Android-Version unserer Desktop-App:
zh_cn: 首次启动应用程序时，它需要将自己解压缩到设备上。这可能需要几秒钟。解压完成后，您将看到桌面应用程序的 Android 版本：

source: App from Tutorial 2, fully launched
de: App aus Tutorial 2, vollständig gestartet
zh_cn: 完全启动后的教程 2 应用程序

source: Demo app fully launched
de: Demo-App vollständig gestartet
zh_cn: 完全启动后的演示应用程序

source: If you fail to see your app launching, you may need to check your terminal where you ran ``briefcase run`` and look for any error messages.
de: Wenn Sie nicht sehen, dass Ihre Anwendung startet, sollten Sie Ihr Terminal überprüfen, in dem Sie ``briefcase run`` ausgeführt haben, und nach Fehlermeldungen suchen.

source: While the app is running, you'll see a lot of messages being streamed in the console. This is a stream of the application's logs from the emulator. Typing Ctrl+C into the terminal will halt the streamed information in the console, but it will not close the emulator. This is so you can test new changes without restarting the emulator.
de: Während die App ausgeführt wird, werden in der Konsole zahlreiche Meldungen angezeigt. Dabei handelt es sich um einen Stream der Anwendungsprotokolle aus dem Emulator. Durch Eingabe von Strg+C im Terminal wird die Anzeige der Informationen in der Konsole angehalten, der Emulator wird jedoch nicht geschlossen. Auf diese Weise können Sie neue Änderungen testen, ohne den Emulator neu starten zu müssen.

source: In future, if you want to run on this device without using the menu, you can provide the emulator's name to Briefcase, using ``briefcase run android -d "@beePhone"`` to run on the virtual device directly.
de: Wenn Sie in Zukunft auf diesem Gerät arbeiten wollen, ohne das Menü zu benutzen, können Sie Briefcase den Namen des Emulators mitteilen, indem Sie ``briefcase run android -d @beePhone`` verwenden, um direkt auf dem virtuellen Gerät zu arbeiten.

source: Run the app on a physical device
de: Ausführen der App auf einem physischen Gerät

source: If you have a physical Android phone or tablet, you can connect it to your computer with a USB cable, and then use the Briefcase to target your physical device.
de: Wenn Sie ein physisches Android-Telefon oder -Tablet besitzen, können Sie es mit einem USB-Kabel an Ihren Computer anschließen und dann Briefcase verwenden, um Ihr physisches Gerät anzusteuern.

source: Android requires that you prepare your device before it can be used for development. You will need to make 2 changes to the options on your device:
de: Android erfordert, dass Sie Ihr Gerät vorbereiten, bevor Sie es für die Entwicklung verwenden können. Sie müssen 2 Änderungen an den Optionen auf Ihrem Gerät vornehmen:

source: Enable developer options
de: Entwickleroptionen aktivieren

source: Enable USB debugging
de: USB-Debugging einschalten

source: Details on how to make these changes can be found `in the Android developer documentation <https://developer.android.com/studio/debug/dev-options#enable>`__.
de: Details zur Durchführung dieser Änderungen können in der Android-Entwicklerdokumentation <https://developer.android.com/studio/debug/dev-options#enable>`__ nachgelesen werden.

source: Once these steps have been completed, your device should appear in the list of available devices when you run ``briefcase run android``.
de: Sobald diese Schritte abgeschlossen sind, sollte Ihr Gerät in der Liste der verfügbaren Geräte erscheinen, wenn Sie ``briefcase run android`` ausführen.

source: Here we can see a new physical device with it's serial number on the deployment list - in this case, a Pixel 3a. In the future, if you want to run on this device without using the menu, you can provide the phone's serial number to Briefcase (in this case, ``briefcase run android -d 94ZZY0LNE8``). This will run on the device directly, without prompting.
de: Hier sehen wir ein neues physisches Gerät mit seiner Seriennummer in der Einsatzliste - in diesem Fall ein Pixel 3a. Wenn Sie in Zukunft auf diesem Gerät arbeiten möchten, ohne das Menü zu verwenden, können Sie die Seriennummer des Telefons an Briefcase übergeben (in diesem Fall ``briefcase run android -d 94ZZY0LNE8``). Dies wird direkt auf dem Gerät ausgeführt, ohne dass Sie gefragt werden.

source: My device doesn't appear!
de: Mein Gerät wird nicht angezeigt!

source: If your device doesn't appear on this list at all, either you haven't enabled USB debugging, (or the device isn't plugged in!).
de: Wenn Ihr Gerät in dieser Liste nicht erscheint, haben Sie entweder das USB-Debugging nicht aktiviert (oder das Gerät ist nicht eingesteckt!).

source: If your device appears, but is listed as "Unknown device (not authorized for development)", developer mode hasn't been correctly enabled. Re-run `the steps to enable developer options <https://developer.android.com/studio/debug/dev-options#enable>`__, and re-run ``briefcase run android``.
de: Wenn Ihr Gerät zwar angezeigt wird, aber als "Unbekanntes Gerät (nicht für die Entwicklung autorisiert)" aufgeführt ist, wurde der Entwicklermodus nicht korrekt aktiviert. Führen Sie die "Schritte zum Aktivieren der Entwickleroptionen <https://developer.android.com/studio/debug/dev-options#enable>" erneut aus, und führen Sie "Briefcase run android" erneut aus.

source: Next steps
de: Nächste Schritte
zh_cn: 下一步

source: We've now got an application on our phone! Is there anywhere else we can deploy a BeeWare app? Turn to :doc:`Tutorial 6 <../tutorial-6>` to find out...
de: Wir haben jetzt eine Anwendung auf unserem Telefon! Gibt es noch einen anderen Ort, an dem wir eine BeeWare-Anwendung einsetzen können? Schauen Sie sich :doc:`Tutorial 6 <../tutorial-6>` an, um das herauszufinden...
zh_cn: 我们现在已经在手机上安装了应用程序！还有其他地方可以部署 BeeWare 应用程序吗？请参考\ :doc:`教程 6 <../tutorial-6>`\ 了解更多...
