Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/tutorial-5/iOS.po
Languages: de, zh_cn

source: Tutorial 5 - Taking it mobile: iOS
de: Tutorial 5 – Mobil nutzen: iOS
zh_cn: 教程 5 - 在移动设备上：iOS

source: To compile iOS applications we'll need Xcode, which is available for free from `the macOS App Store <https://apps.apple.com/au/app/xcode/id497799835?mt=12>`__. Once Xcode is installed, launch it from Applications and accept the Xcode License Agreement. Next, Xcode will show which components are built-in, and which components you may download. Select the checkbox next to iOS (followed by the current version number), and then click "Download and Install" to install it. Xcode will install the system components, followed by the iOS Simulator.
de: Um iOS-Anwendungen zu kompilieren, benötigen wir Xcode, das kostenlos im macOS App Store <https://apps.apple.com/au/app/xcode/id497799835?mt=12>__ erhältlich ist. Sobald Xcode installiert ist, starten Sie es über „Anwendungen” und akzeptieren Sie die Xcode-Lizenzvereinbarung. Als Nächstes zeigt Xcode an, welche Komponenten integriert sind und welche Komponenten Sie herunterladen können. Aktivieren Sie das Kontrollkästchen neben iOS (gefolgt von der aktuellen Versionsnummer) und klicken Sie dann auf „Herunterladen und installieren“, um es zu installieren. Xcode installiert die Systemkomponenten und anschließend den iOS-Simulator.
zh_cn: 编译 iOS 应用程序需要 Xcode，可从 `macOS App Store <https://apps.apple.com/au/app/xcode/id497799835?mt=12>`__ 免费下载。当 Xcode 完成安装时，从“应用程序”打开它并接受 Xcode 许可协议。接下来，Xcode 会展示哪些模拟器运行时已内置，哪些可以下载。选择 iOS 模拟器运行时旁边的复选框，并点击“继续”来下载和安装它。

source: Once we've got Xcode and the iOS simulator installed, we can take our application and deploy it as an iOS app.
de: Sobald wir Xcode und den iOS-Simulator installiert haben, können wir unsere Anwendung als iOS-App bereitstellen.
zh_cn: 安装好 Xcode 与 iOS 模拟器后，我们就可以将应用程序作为 iOS 应用程序进行部署。

source: The process of deploying an application to iOS is very similar to the process for deploying as a desktop application. First, you run the ``create`` command - but this time, we specify that we want to create an iOS application:
de: Der Prozess der Bereitstellung einer Anwendung für iOS ist dem Prozess der Bereitstellung als Desktop-Anwendung sehr ähnlich. Zuerst führen Sie den Befehl ``create`` aus - aber dieses Mal geben wir an, dass wir eine iOS-Anwendung erstellen wollen:
zh_cn: 将应用程序部署到 iOS 的过程与部署桌面应用程序的过程非常相似。首先，运行 ``create`` 命令，但这次我们指定要创建一个 iOS 应用程序：

source: Once this completes, we'll have a ``build/helloworld/ios/xcode`` directory containing an Xcode project, as well as the support libraries and the application code needed for the application.
de: Sobald dies abgeschlossen ist, haben wir ein ``build/helloworld/ios/xcode`` Verzeichnis, das ein Xcode Projekt enthält, sowie die unterstützenden Bibliotheken und den Anwendungscode, der für die Anwendung benötigt wird.
zh_cn: 完成此操作后，我们将拥有一个包含 Xcode 项目、支持库和应用程序所需应用程序代码的 ``build/helloworld/ios/xcode`` 目录。

source: You can then use Briefcase to compile your app using ``briefcase build iOS``:
de: Sie können dann Briefcase verwenden, um Ihre Anwendung mit ``briefcase build iOS`` zu kompilieren:
zh_cn: 然后，您可以使用 ``briefcase build iOS`` 来编译应用程序：

source: We're now ready to run our application, using ``briefcase run iOS``. You'll be prompted to select a device to compile for; if you've got simulators for multiple iOS SDK versions installed, you may also be asked which iOS version you want to target. The options you are shown may differ from the options show in this output - at the very least, the list of devices will likely be different. For our purposes, it doesn't matter which simulator you pick.
de: Wir sind nun bereit, unsere Anwendung mit ``briefcase run iOS`` zu starten. Sie werden aufgefordert, ein Gerät auszuwählen, für das kompiliert werden soll. Wenn Sie Simulatoren für mehrere iOS SDK-Versionen installiert haben, werden Sie möglicherweise auch gefragt, welche iOS-Version Sie verwenden möchten. Die Optionen, die Ihnen angezeigt werden, können sich von den in dieser Ausgabe gezeigten Optionen unterscheiden - zumindest wird die Liste der Geräte wahrscheinlich anders aussehen. Für unsere Zwecke spielt es keine Rolle, welchen Simulator Sie wählen.
zh_cn: 现在我们可以使用 ``briefcase run iOS`` 运行应用程序了。Briefcase 会提示你选择要编译的设备；如果你安装了多个 iOS SDK 版本的模拟器，可能还会询问你要针对哪个 iOS 版本。所显示的选项可能与此输出中显示的选项不同，至少设备列表可能不同。就我们而言，选择哪个模拟器并不重要。

source: This will start the iOS simulator, install your app, and start it. You should see the simulator start, and eventually open your iOS application:
de: Dadurch wird der iOS-Simulator gestartet, Ihre Anwendung installiert und gestartet. Sie sollten sehen, dass der Simulator startet und schließlich Ihre iOS-Anwendung öffnet:
zh_cn: 这将启动 iOS 模拟器，安装你的应用程序并启动它。你应该能看到模拟器启动，并最终打开你的 iOS 应用程序：

source: Hello World Tutorial 5 window, on iOS
de: Hello World Tutorial 5 Fenster, auf iOS
zh_cn: Hello World 教程 5 窗口，在 iOS 上

source: While the app is running, you'll see a series of Simulator log output messages in the console. Typing Ctrl+C into the terminal will halt the messages in the console, but it will not close the simulator. This is so you can test new changes without restarting the simulator.
de: Während die App ausgeführt wird, werden in der Konsole eine Reihe von Simulator-Protokollausgabemeldungen angezeigt. Durch Eingabe von Strg+C im Terminal werden die Meldungen in der Konsole angehalten, der Simulator wird jedoch nicht geschlossen. Auf diese Weise können Sie neue Änderungen testen, ohne den Simulator neu starten zu müssen.
zh_cn: 当应用程序运行时，您会在控制台中看到一系列模拟器输出信息。向命令行中按 Ctrl + C 会停止控制台中的信息，但不会关闭模拟器。这样，您无需重启模拟器，也能可以继续测试新更改。

source: If you know ahead of time which iOS simulator you want to target, you can tell Briefcase to use that simulator by providing a ``-d`` (or ``--device``) option. Using the name of the device you selected when you built your application, run:
de: Wenn Sie bereits im Voraus wissen, welchen iOS-Simulator Sie verwenden möchten, können Sie Briefcase mit der Option ``-d`` (oder ``--device``) anweisen, diesen Simulator zu verwenden. Verwenden Sie den Namen des Geräts, das Sie beim Erstellen Ihrer Anwendung ausgewählt haben, und führen Sie es aus:
zh_cn: 如果事先知道要使用哪个 iOS 模拟器，可以通过提供 ``-d``（或 ``--device``）选项告诉 Briefcase 使用该模拟器。使用创建应用程序时选择的设备名称，运行:

source: If you have multiple iOS versions available, Briefcase will pick the highest iOS version; if you want to pick a particular iOS version, you tell it to use that specific version:
de: Wenn Sie mehrere iOS-Versionen zur Verfügung haben, wählt Briefcase die höchste iOS-Version aus; wenn Sie eine bestimmte iOS-Version auswählen möchten, weisen Sie das Programm an, diese Version zu verwenden:
zh_cn: 如果你有多个 iOS 版本，Briefcase 会选择最高的 iOS 版本；如果你想选择某个 iOS 版本，你可以告诉它使用该特定版本：

source: Or, you can name a specific device UDID:
de: Oder Sie können ein bestimmtes Gerät UDID nennen:
zh_cn: 或者，您也可以命名一个特定的设备 UDID：

source: Next steps
de: Nächste Schritte
zh_cn: 下一步

source: We've now got an application on our phone! Is there anywhere else we can deploy a BeeWare app? Turn to :doc:`Tutorial 6 <../tutorial-6>` to find out...
de: Wir haben jetzt eine Anwendung auf unserem Telefon! Gibt es noch einen anderen Ort, an dem wir eine BeeWare-Anwendung einsetzen können? Schauen Sie sich :doc:`Tutorial 6 <../tutorial-6>` an, um das herauszufinden...
zh_cn: 我们现在已经在手机上安装了应用程序！还有其他地方可以部署 BeeWare 应用程序吗？请参考\ :doc:`教程 6 <../tutorial-6>`\ 了解更多...
