Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/topics/custom-icons.po
Languages: de

source: Customizing icons
de: Symbole anpassen

source: The app we developed in the main tutorial uses a default "gray bee" icon when it is packaged. Let's personalize this application by configuring it to use our own icon.
de: Die App, die wir im Haupttutorial entwickelt haben, verwendet beim Verpacken standardmäßig das Symbol „gray bee“. Personalisieren wir diese Anwendung, indem wir sie so konfigurieren, dass sie unser eigenes Symbol verwendet.

source: Adding an icon
de: Hinzufügen eines Symbols

source: Every platform uses a different format for application icons - and some platforms need *multiple* icons in different sizes and shapes. To account for this, Briefcase provides a shorthand way to configure an icon once, and then have that definition expand in to all the different icons needed for each individual platform.
de: Jede Plattform verwendet ein anderes Format für Anwendungssymbole – und einige Plattformen benötigen *mehrere* Symbole in unterschiedlichen Größen und Formen. Um dies zu berücksichtigen, bietet Briefcase eine Kurzform, mit der Sie ein Symbol einmal konfigurieren und diese Definition dann auf alle verschiedenen Symbole erweitern können, die für jede einzelne Plattform erforderlich sind.

source: Edit your ``pyproject.toml``, adding a new ``icon`` configuration item in the ``[tool.briefcase.app.helloworld]`` configuration section, just above the ``sources`` definition::
de: Bearbeiten Sie Ihr ``pyproject.toml`` und fügen Sie ein neues Konfigurationselement ``Symbol`` im Konfigurationsabschnitt ``[tool.briefcase.app.helloworld]`` direkt über der Definition von ``Quellen`` hinzu::

source: This icon definition doesn't specify any file extension. The value will be used as a prefix; each platform will add additional items to this prefix to build the files needed for each platform. Some platforms require *multiple* icon files; this prefix will be combined with file size and variant modifiers to generate the list of icon files that are used.
de: Diese Icon-Definition gibt keine Dateierweiterung an. Der Wert wird als Präfix verwendet; jede Plattform fügt diesem Präfix zusätzliche Elemente hinzu, um die für die jeweilige Plattform erforderlichen Dateien zu erstellen. Einige Plattformen erfordern *mehrere* Icon-Dateien; dieses Präfix wird mit Dateigröße und Variantenmodifikatoren kombiniert, um die Liste der verwendeten Icon-Dateien zu generieren.

source: We can now run ``briefcase update`` again - but this time, we pass in the ``--update-resources`` flag, telling Briefcase that we want to install new application resources (i.e., the icons):
de: Wir können nun erneut „briefcase update“ ausführen – diesmal jedoch mit dem Flag „--update-resources“, um Briefcase mitzuteilen, dass wir neue Anwendungsressourcen (d. h. die Symbole) installieren möchten:

source: This reports the specific icon file (or files) that Briefcase is expecting. However, as we haven't provided the actual icon files, the install fails, and Briefcase falls back to a default value (the same "gray bee" icon).
de: Dies gibt die spezifische(n) Icon-Datei(en) an, die Briefcase erwartet. Da wir jedoch keine tatsächlichen Icon-Dateien bereitgestellt haben, schlägt die Installation fehl und Briefcase greift auf einen Standardwert zurück (das gleiche „graue Bienen”-Icon).

source: Let's provide some actual icons. Download :download:`this icons.zip bundle <../resources/icons.zip>`, and unzip it into the root of your project directory. After unzipping, your project directory should look something like::
de: Lassen Sie uns einige tatsächliche Symbole bereitstellen. Laden Sie :download:`dieses icons.zip-Paket <../resources/icons.zip>` herunter und entpacken Sie es in das Stammverzeichnis Ihres Projektverzeichnisses. Nach dem Entpacken sollte Ihr Projektverzeichnis in etwa so aussehen::

source: There's a *lot* of icons in this folder, but most of them should look the same: a green snake on a light blue background:
de: In diesem Ordner befinden sich *sehr viele* Symbole, aber die meisten davon sollten gleich aussehen: eine grüne Schlange auf hellblauem Hintergrund:

source: Icon of green snake with a light blue background
de: Symbol einer grünen Schlange vor hellblauem Hintergrund

source: The only exception will be the icons with ``-adaptive-`` in their name; these will have a transparent background. This represents all the different icon sizes and shapes you need to support an app on every platform that Briefcase supports.
de: Die einzige Ausnahme bilden die Symbole mit „-adaptive-“ im Namen; diese haben einen transparenten Hintergrund. Dies umfasst alle verschiedenen Symbolgrößen und -formen, die Sie benötigen, um eine App auf jeder von Briefcase unterstützten Plattform zu unterstützen.

source: Now that we have icons, we can update the application again. However, ``briefcase update`` will only copy the updated resources into the build directory; we also want to rebuild the app to make sure the new icon is included, then start the app. We can shortcut this process by passing ``--update-resources`` to our call to ``run`` - this will update the app, update the app's resources, and then start the app:
de: Jetzt, da wir über Symbole verfügen, können wir die Anwendung erneut aktualisieren. Allerdings kopiert „briefcase update“ nur die aktualisierten Ressourcen in das Build-Verzeichnis. Wir möchten jedoch auch die Anwendung neu erstellen, um sicherzustellen, dass das neue Symbol enthalten ist, und dann die Anwendung starten. Wir können diesen Vorgang abkürzen, indem wir „--update-resources“ an unseren Aufruf von „run“ übergeben. Dadurch wird die Anwendung aktualisiert, die Ressourcen der Anwendung aktualisiert und anschließend die Anwendung gestartet:

source: If you're using a recent version of Android, you may notice that the app icon has been changed to a green snake, but the background of the icon is *white*, rather than light blue. We'll fix this in the next step.
de: Wenn Sie eine aktuelle Version von Android verwenden, werden Sie möglicherweise feststellen, dass das App-Symbol zu einer grünen Schlange geändert wurde, der Hintergrund des Symbols jedoch *weiß* statt hellblau ist. Wir werden dies im nächsten Schritt beheben.

source: If you get a stack trace referencing ``faker`` or ``httpx`` when you run the app, it's possible you missed running your app during step 7 or 8 of the tutorial. Re-run the app, adding the ``-r`` argument to update the app requirements.
de: Wenn Sie beim Ausführen der App einen Stacktrace erhalten, der auf „faker“ oder „httpx“ verweist, haben Sie möglicherweise Schritt 7 oder 8 des Tutorials übersprungen. Führen Sie die App erneut aus und fügen Sie das Argument „-r“ hinzu, um die App-Anforderungen zu aktualisieren.

source: When you run the app on iOS or Android, in addition to the icon change, you should also notice that the splash screen incorporates the new icon. However, the light blue background of the icon looks a little out of place against the white background of the splash screen. We can fix this by customizing the background color of the splash screen. Add the following definition to your ``pyproject.toml``, just after the ``icon`` definition::
de: Wenn Sie die App auf iOS oder Android ausführen, sollten Sie neben der Änderung des Symbols auch feststellen, dass das neue Symbol in den Begrüßungsbildschirm integriert ist. Allerdings wirkt der hellblaue Hintergrund des Symbols vor dem weißen Hintergrund des Begrüßungsbildschirms etwas deplatziert. Wir können dies beheben, indem wir die Hintergrundfarbe des Begrüßungsbildschirms anpassen. Fügen Sie die folgende Definition zu Ihrer ``pyproject.toml`` hinzu, direkt nach der Definition ``icon``::

source: Unfortunately, Briefcase isn't able to apply this change to an already generated project, as it requires making modifications to one of the files that was generated during the original call to ``briefcase create``. To apply this change, we have to re-create the app by re-running ``briefcase create``. When we do this, we'll be prompted to confirm that we want to overwrite the existing project:
de: Leider kann Briefcase diese Änderung nicht auf ein bereits generiertes Projekt anwenden, da dafür Änderungen an einer der Dateien vorgenommen werden müssen, die beim ursprünglichen Aufruf von „briefcase create“ generiert wurden. Um diese Änderung anzuwenden, müssen wir die App neu erstellen, indem wir „briefcase create“ erneut ausführen. Dabei werden wir aufgefordert, zu bestätigen, dass wir das vorhandene Projekt überschreiben möchten:

source: You can then re-build and re-run the app using ``briefcase run``. You won't notice any changes to the desktop app; but the Android or iOS apps should now have a light blue splash screen background.
de: Sie können die App dann mit „briefcase run“ neu erstellen und erneut ausführen. An der Desktop-App werden Sie keine Änderungen bemerken, aber die Android- oder iOS-Apps sollten nun einen hellblauen Hintergrund für den Begrüßungsbildschirm haben.

source: You'll need to re-create the app like this whenever you make a change to your ``pyproject.toml`` that doesn't relate to source code or dependencies. Any change to descriptions, version numbers, colors, or permissions will require a re-create step. Because of this, while you are developing your project, you shouldn't make any manual changes to the contents of the ``build`` folder, and you shouldn't add the ``build`` folder to your version control system. The ``build`` folder should be considered entirely ephemeral - an output of the build system that can be recreated as needed to reflect the current configuration of your project.
de: Sie müssen die App jedes Mal neu erstellen, wenn Sie Änderungen an Ihrer ``pyproject.toml`` vornehmen, die nicht den Quellcode oder die Abhängigkeiten betreffen. Jede Änderung an Beschreibungen, Versionsnummern, Farben oder Berechtigungen erfordert einen Neuanlegungsvorgang. Aus diesem Grund sollten Sie während der Entwicklung Ihres Projekts keine manuellen Änderungen am Inhalt des Ordners „build“ vornehmen und den Ordner „build“ nicht zu Ihrem Versionskontrollsystem hinzufügen. Der Ordner „build“ sollte als vollständig vergänglich betrachtet werden – als Ausgabe des Build-Systems, die bei Bedarf neu erstellt werden kann, um die aktuelle Konfiguration Ihres Projekts widerzuspiegeln.
