Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: de_de

source: **Languages**:
de_de: **Sprachen**

source: `German <de/index.html>`__
de_de: Ènglisch <../index.html>`__

source: **Write Python. Run Anywhere.**
de_de: **Einmal schreiben. Überall verwenden**

source: BeeWare is a suite of tools and libraries, each of which works together to help you write cross platform native GUI Python applications. It includes:
de_de: BeeWare ist ein Tool- und Bibliothekenpacket, mit welchem man Cross-Platform Programme schreiben kann. Es enthält:

source: `Toga <https://toga.readthedocs.io>`__, a cross platform widget toolkit;
de_de: `Toga <https://toga.readthedocs.io>`__, ein Cross-Platform, Widget Toolkit;

source: `Briefcase <https://briefcase.readthedocs.io>`__, a tool for packaging Python projects as distributable artefacts that can be shipped to end users;
de_de: `Briefcase <https://briefcase.readthedocs.io>`__, ein Werkzeug zum verpacken von Pythonprojekten als vollwertige Installationsdateien;

source: `Rubicon ObjC <https://rubicon-objc.readthedocs.io>`__, a library for working with Objective C libraries on iOS and macOS from within Python code;
de_de: `Rubicon ObjC <https://rubicon-objc.readthedocs.io>`__, eine Bibliothek, mit der man mitObjective C Bibliotheken für iOS and macOS in Python arbeiten kann.;

source: `Rubicon Java <https://rubicon-java.readthedocs.io>`__, a library for working with Java libraries from within Python code;
de_de: `Rubicon Java <https://rubicon-java.readthedocs.io>`__, eine Bibliothek, mit der man mitJava libraries in Python arbeiten kann.;

source: Pre-compiled builds of Python that can be used on platforms where official Python installers aren't available.
de_de: Python installationen für Platformen, für die es keine offiziellen Python-binaries gibt.

source: You can use each of the tools in isolation, or you can use all of them as a suite.
de_de: Diese Werkzeuge können alleine oder in Verbindung miteinander verwendet werden.

source: The full BeeWare suite also includes `software development tools <https://beeware.org/project/projects/tools/>`__ and `applications <https://beeware.org/project/projects/applications/>`__ that have been written using BeeWare's own libraries.
de_de: Die BeeWare suite enthält auch `software development tools<https://beeware.org/project/projects/tools/>`__ und `apps<https://beeware.org/project/projects/applications/>`__ welche mit der BeeWaresuite geschrieben wurden.

source: The BeeWare suite is available on macOS, Windows, Linux (using GTK); on mobile platforms such as Android and iOS; and for the Web. Support for other platforms (such as set top boxes and watches) is on our long term roadmap.
de_de: Beeware unterstützt macOS, Windows, Linux(unter verwendung von GTK); Androidund iOS Handys; und platforms such as Android and iOS; und Django(Internet).Weitere Platformen, wie Set-Top-Boxen und Smartwatches sind in Planung.

source: The BeeWare suite is a work in progress. Some tools and libraries are more mature than others, and some platforms have better support than others. In particular, Web support should be considered experimental only.
de_de: BeeWare ist work in progress. Manche Werkzeuge und Bibliotheken sind weiter,und manche Platformen funktionieren schon besser. Web und Android noch in Erprobung.

source: Ready to try BeeWare for yourself? :doc:`Let's build a cross platform application in Python! <tutorial/tutorial-0>`
de_de: Sie wollen BeeWare ausprobieren? :doc:`Erstellen wir eine Cross-Platform-Appin Python! <tutorial/tutorial-0>`
