Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/tutorial-0.po
Languages: de, es, fr, pt, zh_tw

source: If you're on macOS, a recent version of Python is included with Xcode or the command line developer tools. To check if you already have it, run the following command:
fr: Si vous utilisez macOS, une version récente de Python est incluse dans Xcode ou dans les outils de développement en ligne de commande. Pour vérifier si vous l'avez déjà, exécutez la commande suivante :
pt: Se você estiver usando o macOS, uma versão recente do Python já está incluída no Xcode ou nas ferramentas de linha de comando. Para verificar se você já o possui, execute o seguinte comando:
zh_tw: 如果您使用的是 macOS，則 Xcode 或命令列開發人員工具中包含最新版本的 Python。要檢查您是否已經擁有它，請執行以下命令：

source: If Python is installed, you'll see its version number. Otherwise, you'll be prompted to install the command line developer tools.
fr: Si Python est installé, vous verrez son numéro de version. Sinon, vous serez invité à installer les outils de développement en ligne de commande.
pt: Se o Python estiver instalado, você verá o número da versão. Caso contrário, será solicitado que instale as ferramentas de linha de comando para desenvolvedores.
zh_tw: 如果安裝了 Python，您將看到其版本號。否則，系統將提示您安裝命令列開發人員工具。
