Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/tutorial-1.po
Languages: de, zh_cn

source: Tutorial 1 - Your first app
de: Tutorial 1 - Ihre erste App
zh_cn: 教程 1 - 您的第一个应用程序

source: We're ready to create our first application.
de: Wir sind bereit, unsere erste Anwendung zu erstellen.
zh_cn: 我们准备好创建我们的第一个应用程序了。

source: Install the BeeWare tools
de: Installieren Sie die BeeWare-Tools
zh_cn: 安装 BeeWare 工具

source: First, we need to install **Briefcase**. Briefcase is a BeeWare tool that can be used to package your application for distribution to end users - but it can also be used to bootstrap a new project. Make sure you're in the ``beeware-tutorial`` directory you created in :doc:`Tutorial 0 <tutorial-0>`, with the ``beeware-venv`` virtual environment activated, and run:
de: Zunächst müssen wir **Briefcase** installieren. Briefcase ist ein BeeWare-Werkzeug, das verwendet werden kann, um Ihre Anwendung für die Verteilung an Endbenutzer zu verpacken - aber es kann auch verwendet werden, um ein neues Projekt zu starten. Vergewissern Sie sich, dass Sie sich in dem Verzeichnis ``beeware-tutorial`` befinden, das Sie in :doc:`Tutorial 0 <tutorial-0>` erstellt haben, und dass die virtuelle Umgebung ``beeware-venv`` aktiviert ist, und starten Sie:
zh_cn: 首先，我们需要安装 **Briefcase**。Briefcase 是一款 BeeWare 工具，可用于打包应用程序，以便分发给最终用户；但它也可用于引导新项目。确保您在 :doc:`教程0 <tutorial-0>` 中创建的 ``beeware-tutorial`` 目录中，并已激活 ``beeware-venv`` 虚拟环境，然后运行：

source: Possible errors during installation
de: Mögliche Fehler bei der Installation
zh_cn: 安装过程中可能出现的错误

source: If you see errors during installation, it's almost certainly because some of the system requirements haven't been installed. Make sure you have :ref:`installed all the platform pre-requisites <install-dependencies>`.
de: Wenn Sie während der Installation Fehler sehen, liegt das höchstwahrscheinlich daran, dass einige der Systemvoraussetzungen nicht installiert wurden. Stellen Sie sicher, dass Sie :ref:`alle Plattformvoraussetzungen <install-dependencies>` installiert haben.
zh_cn: 如果在安装过程中出现错误，几乎可以肯定是因为某些系统要求尚未安装。请确保您已\ :ref:`安装了所有您的平台的先决条件 <install-dependencies>`。

source: It is important that you use ``python -m pip``, rather than a bare ``pip``. Briefcase needs to ensure that it has an up-to-date version of ``pip`` and ``setuptools``, and a bare invocation of ``pip`` can't self-update. If you want to know more, `Brett Cannon has a detailed blog post about the issue <https://snarky.ca/why-you-should-use-python-m-pip/>`__.
de: Es ist wichtig, dass Sie ``python -m pip`` und nicht ``pip`` verwenden. Briefcase muss sicherstellen, dass es eine aktuelle Version von ``pip`` und ``setuptools`` hat, und ein bloßer Aufruf von ``pip`` kann sich nicht selbst aktualisieren. Wenn Sie mehr darüber wissen wollen, hat `Brett Cannon einen detaillierten Blogbeitrag zu diesem Problem <https://snarky.ca/why-you-should-use-python-m-pip/>`__.
zh_cn: 请务必使用 ``python -m pip``，而不是简单的 ``pip``。Briefcase 需要确保它拥有最新版本的 ``pip`` 和 ``setuptools`` ，而裸调用的 ``pip`` 无法自我更新。如果您想了解更多，`Brett Cannon 有一篇关于这个问题的详细博文 <https://snarky.ca/why-you-should-use-python-m-pip/>`__。

source: Bootstrap a new project
de: Erstellen Sie ein neues Projekt
zh_cn: 引导新项目

source: Let's start our first BeeWare project! We're going to use the Briefcase ``new`` command to create an application called **Hello World**. Run the following from your command prompt:
de: Beginnen wir mit unserem ersten BeeWare-Projekt! Wir werden den Briefcase-Befehl ``new`` verwenden, um eine Anwendung namens **Hello World** zu erstellen. Führen Sie den folgenden Befehl in Ihrer Eingabeaufforderung aus:
zh_cn: 让我们开始我们的第一个 BeeWare 项目！ 我们将使用 Briefcase 的 ``new`` 命令创建一个名为 **Hello World** 的应用程序。在命令提示符下运行以下命令:

source: Briefcase will ask us for some details of our new application. For the purposes of this tutorial, use the following:
de: Briefcase wird uns nach einigen Details zu unserer neuen Anwendung fragen. Verwenden Sie für dieses Tutorial die folgenden Angaben:
zh_cn: Briefcase会要求我们提供新应用程序的一些详细信息。在本教程中，请使用以下内容：

source: **Formal Name** - Accept the default value: ``Hello World``.
de: **Formaler Name** - Akzeptieren Sie den Standardwert: ``Hello World``.
zh_cn: **Formal Name** - 接受默认值：``Hello World``。

source: **App Name** - Accept the default value: ``helloworld``.
de: **App Name** - Akzeptieren Sie den Standardwert: ``helloworld``.
zh_cn: **App Name** - 接受默认值：``helloworld``。

source: **Bundle Identifier** - If you own your own domain, enter that domain in reversed order. (For example, if you own the domain "cupcakes.com", enter ``com.cupcakes`` as the bundle). If you don't own your own domain, accept the default bundle (``com.example``).
zh_cn: **Bundle Identifier（捆绑标识符）** - 如果您拥有自己的域名，请按相反顺序输入该域名。(例如，如果您拥有域名 "cupcakes.com"，则输入 ``com.cupcakes`` 作为捆绑标识符）。如果您没有自己的域名，请接受默认值（``com.example``）。

source: **Project Name** - Accept the default value: ``Hello World``.
de: **Projektname** - Übernehmen Sie den Standardwert: ``Hello World``.
zh_cn: **Project Name** - 接受默认值：``Hello World``。

source: **Description** - Accept the default value (or, if you want to be really creative, come up with your own description!)
de: **Description** - Übernehmen Sie den Standardwert (wenn Sie wirklich kreativ sein wollen, denken Sie sich Ihre eigene Beschreibung aus!)
zh_cn: **描述** - 接受默认值（或者，如果您想发挥自己的创造力，也可以提出自己的描述！）

source: **Author** - Enter your own name here.
de: **Author** - Geben Sie hier Ihren eigenen Namen ein.
zh_cn: **Author** - 在此处输入您自己的名字。

source: **Author's Email** - Enter your own email address. This will be used in the configuration file, in help text, and anywhere that an email is required when submitting the app to an app store.
zh_cn: **Author's Email** - 输入您自己的电子邮件地址。这将用于配置文件、帮助文本以及向应用程序商店提交应用程序时需要电子邮件的任何地方。

source: **Application URL** - The URL of the landing page for your application. Again, if you own your own domain, enter a URL at that domain (including the ``https://``). Otherwise, just accept the default URL (``https://example.com/helloworld``). This URL doesn't need to actually exist (for now); it will only be used if you publish your application to an app store.
zh_cn: **URL** - 应用程序登陆页面的 URL。同样，如果您拥有自己的域名，请输入该域名的 URL（包括 ``https://``）。否则，接受默认 URL (``https://example.com/helloworld``) 即可。此 URL（暂时）不需要实际存在；只有在您将应用程序发布到应用程序商店时才会使用。

source: **Project License** - Accept the default license (BSD). This won't affect anything about the operation of the tutorial, though - so if you have particularly strong feelings about license choice, feel free to choose another license.
zh_cn: **Project License** (项目许可证) - 接受默认许可证（BSD）。这不会影响本教程的任何操作，因此，如果您对许可证选择有特别强烈的意见，请随意选择其他许可证。

source: **GUI framework** - Accept the default option, Toga (BeeWare's own GUI toolkit).
de: **GUI-Framework** - Akzeptieren Sie die Standardoption Toga (BeeWare's eigenes GUI-Toolkit).
zh_cn: **GUI Framework** - 接受默认选项 Toga（BeeWare 自己的图形用户界面工具包）。

source: Briefcase will then generate a project skeleton for you to use. If you've followed this tutorial so far, and accepted the defaults as described, your file system should look something like::
de: Briefcase generiert dann ein Projektgerüst, das Sie verwenden können. Wenn Sie diesem Tutorial bis hierher gefolgt sind und die Vorgaben wie beschrieben akzeptiert haben, sollte Ihr Dateisystem etwa so aussehen::
zh_cn: 接下来，Briefcase 会生成一个项目骨架供你使用。如果你到目前为止都已经跟着这个教程走的话，并接受了所述的默认设置，那么你的文件系统应该是这样的::

source: This skeleton is actually a fully functioning application without adding anything else. The ``src`` folder contains all the code for the application, the ``tests`` folder contains an initial test suite, and the ``pyproject.toml`` file describes how to package the application for distribution. If you open ``pyproject.toml`` in an editor, you'll see the configuration details you just provided to Briefcase.
de: Dieses Gerüst ist bereits eine voll funktionsfähige Anwendung, ohne etwas anderes hinzufügen zu müssen. Der Ordner ``rc`` enthält den gesamten Code für die Anwendung, der Ordner ``tests`` enthält eine erste Testreihe und die Datei ``pyproject.toml`` beschreibt, wie die Anwendung für die Verteilung verpackt werden soll. Wenn Sie die Datei ``pyproject.toml`` in einem Editor öffnen, sehen Sie die Konfigurationsdetails, die Sie Briefcase gerade mitgeteilt haben.
zh_cn: 该骨架实际上是一个功能完备的应用程序，无需添加任何其他内容。``src`` 文件夹包含应用程序的所有代码，``tests`` 文件夹包含初始测试套件，``pyproject.toml`` 文件描述了如何打包发布应用程序。如果您用编辑器打开 ``pyproject.toml``，就会看到刚才提供给 Briefcase 的配置详细信息。

source: Now that we have a stub application, we can use Briefcase to run the application.
de: Nun, da wir eine Rumpfanwendung haben, können wir Briefcase verwenden, um die Anwendung auszuführen.
zh_cn: 现在我们有了一个包含占位代码的应用程序，可以使用 Briefcase 来运行它。

source: Run the app in developer mode
de: Führen Sie die Anwendung im Entwicklermodus aus
zh_cn: 在开发者模式下运行应用程序

source: Move into the ``helloworld`` project directory and tell briefcase to start the project in Developer (or ``dev``) mode:
zh_cn: 移动到 ``helloworld`` 项目目录，告诉 Briefcase 以开发者（或 ``dev``）模式启动项目：

source: This should open a GUI window:
de: Dies sollte ein GUI-Fenster öffnen:
zh_cn: 这将打开一个图形用户界面 (GUI) 窗口：

source: Hello World Tutorial 1 window, on macOS
de: Hello World Tutorial 1 Fenster unter macOS
zh_cn: macOS 上的 Hello World 教程 1 窗口

source: Hello World Tutorial 1 window, on Linux
de: Hello World Tutorial 1 Fenster unter Linux
zh_cn: 在 Linux 上的 Hello World 教程 1 窗口

source: Hello World Tutorial 1 window, on Windows
de: Hello World Tutorial 1 Fenster unter Windows
zh_cn: 在 Windows 上的 Hello World 教程 1 窗口

source: Invalid requirements or pip unable to connect
de: Ungültige Anforderungen oder pip kann keine Verbindung herstellen
zh_cn: 无效的要求或 pip 无法连接

source: If you encounter the error:
de: Wenn Sie die folgende Fehlermeldung erhalten:
zh_cn: 如果您遇到错误：

source: Confirm that you are running a :ref:`version of python that this tutorial supports <install-python>`.
de: Stellen Sie sicher, dass Sie eine :ref:`Version von Python verwenden, die von diesem Tutorial unterstützt wird <install-python>`.
zh_cn: 确认您在运行\ :ref:`此教程支持的 Python 版本 <install-python>`。

source: If your version of python is *not* a supported version, you will have to restart the tutorial.
de: Wenn Ihre Python-Version *nicht* unterstützt wird, müssen Sie das Tutorial neu starten.
zh_cn: 如果您的 Python 版本\ *不*\ 被支持，则需重新开始本教程。

source: Close the application - either by pressing the close button on the application window, by selecting Quit/Exit from the application's menu, or by typing **Ctrl+C** in the terminal where you ran ``briefcase dev`` - and you're done! Congratulations - you've just written a standalone, native application in Python!
zh_cn: 关闭应用程序 -- 可以使用应用程序窗口上的关闭按钮、从应用程序的菜单栏选择关闭/退出、或在您运行 ``briefcase dev`` 的命令行窗口中按 **Ctrl+C** -- 就完成了！恭喜您，您刚刚使用 Python 编写了一个独立、原生的应用程序！

source: Next steps
de: Nächste Schritte
zh_cn: 下一步

source: We now have a working application, running in developer mode. Now we can add some logic of our own to make our application do something a little more interesting. In :doc:`Tutorial 2 <tutorial-2>`, we'll put a more useful user interface onto our application.
de: Wir haben jetzt eine funktionierende Anwendung, die im Entwicklermodus läuft. Jetzt können wir unsere eigene Logik hinzufügen, damit unsere Anwendung etwas Interessanteres tut. In :doc:`Tutorial 2 <tutorial-2>` werden wir unserer Anwendung eine nützlichere Benutzeroberfläche geben.
zh_cn: 现在，我们有了一个在开发者模式下运行的应用程序。现在我们可以添加一些自己的逻辑，让应用程序做更有趣一些的事情。在\ :doc:`教程 2<tutorial-2>` 中，我们将为应用程序添加一个更有用的用户界面。
