Repository: beeware/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/tutorial-0.po
Languages: de, es, fr, pt, zh_tw

source: Tutorial 0 - Let's get set up!
de: Tutorial 0 - Erstinstallation
es: Tutorial 0 - ¡Preparémonos!
fr: Tutoriel 0 - Préparons-nous !
pt: Tutorial 0 - Vamos nos preparar!
zh_tw: 教學 0 - 讓我們開始設定吧！

source: Before we build our first BeeWare app, we have to make sure we've got all the prerequisites for running BeeWare.
de: Bevor wir unsere erste BeeWare-App erstellen, müssen wir sicherstellen, dass wir alle Voraussetzungen für den Betrieb von BeeWare erfüllen.
es: Antes de crear nuestra primera aplicación BeeWare, tenemos que asegurarnos de que tenemos todos los requisitos previos para ejecutar BeeWare.
fr: Avant de créer notre première application BeeWare, nous devons nous assurer que nous disposons de tous les prérequis pour le fonctionnement de BeeWare.
pt: Antes de criarmos nosso primeiro aplicativo BeeWare, precisamos garantir que tenhamos todos os pré-requisitos para executar o BeeWare.
zh_tw: 在建立第一個 BeeWare 應用程式之前，我們必須確保具備運行 BeeWare 的所有先決條件。

source: Install Python
de: Python installieren
es: Instalar Python
fr: Installer Python
pt: Instalando o Python
zh_tw: 安裝Python

source: The first thing we'll need is a working Python interpreter.
de: Als erstes brauchen wir einen funktionierenden Python-Interpreter.
es: Lo primero que necesitaremos es un intérprete de Python que funcione.
fr: La première chose dont nous avons besoin est un interpréteur Python fonctionnel.
pt: A primeira coisa que precisaremos é de um interpretador Python instalado e funcionando.
zh_tw: 我們首先需要的是一個可用的 Python 直譯器。

source: If you're on macOS, you can get an official Python installer from `the Python website <https://www.python.org/downloads>`_. You can use any version of Python from 3.10 or newer (although you should avoid alphas, betas and release candidates). We strongly recommend using Python 3.13 or newer.
de: Wenn Sie macOS verwenden, können Sie einen offiziellen Python-Installer von der Python-Website <https://www.python.org/downloads>_ herunterladen. Sie können jede Version von Python ab 3.10 verwenden (allerdings sollten Sie Alpha-, Beta- und Release-Candidate-Versionen vermeiden). Wir empfehlen dringend die Verwendung von Python 3.13 oder neuer.

source: You can also install Python through `homebrew <https://docs.brew.sh/Homebrew-and-Python>`__, use `pyenv <https://github.com/pyenv/pyenv#simple-python-version-management-pyenv>`__ to manage multiple Python installs, or use `Anaconda <https://docs.anaconda.com/anaconda/install/>`__ or `Miniconda <https://docs.conda.io/en/latest/miniconda.html>`__. It doesn't matter *how* you've installed Python - it only matters that you can run ``python3`` from your terminal and get a working, supported Python interpreter.
de: Sie können Python auch über `homebrew <https://docs.brew.sh/Homebrew-and-Python>`__ installieren, `pyenv <https://github.com/pyenv/pyenv#simple-python-version-management-pyenv>`__ zur Verwaltung mehrerer Python-Installationen verwenden oder `Anaconda <https://docs. anaconda.com/anaconda/install/>`__ oder `Miniconda <https://docs.conda.io/en/latest/miniconda.html>`__ verwenden. Es spielt keine Rolle, *wie* Sie Python installiert haben – wichtig ist nur, dass Sie ``python3`` von Ihrem Terminal aus ausführen können und einen funktionierenden, unterstützten Python-Interpreter erhalten.

source: Xcode and the Command-line Developer Tools provide a version of Python; however that Python is version 3.9. Python 3.9 has reached end-of-life, and is no longer supported by Python or BeeWare. You will *not* be able to the Xcode-provided version of Python to run this tutorial.
de: Xcode und die Befehlszeilen-Entwicklertools bieten eine Version von Python an; allerdings handelt es sich dabei um Python 3.9. Python 3.9 hat das Ende seiner Lebensdauer erreicht und wird von Python oder BeeWare nicht mehr unterstützt. Sie können die von Xcode bereitgestellte Version von Python *nicht* verwenden, um dieses Tutorial auszuführen.

source: To check the version of Python that you have installed, run the following command:
de: Um die Version von Python zu überprüfen, die Sie installiert haben, führen Sie den folgenden Befehl aus:

source: If Python is installed, you'll see its version number.
de: Wenn Python installiert ist, wird die Versionsnummer angezeigt.

source: If you're on Linux, you'll install Python using the system package manager (``apt`` on Debian/Ubuntu/Mint, ``dnf`` on Fedora, or ``pacman`` on Arch).
de: Unter Linux installieren Sie Python mit dem Paketmanager des Systems (``apt`` unter Debian/Ubuntu/Mint, ``dnf`` unter Fedora, oder ``pacman`` unter Arch).
es: Si estás en Linux, instalarás Python utilizando el gestor de paquetes del sistema (``apt`` en Debian/Ubuntu/Mint, ``dnf`` en Fedora, o ``pacman`` en Arch).
fr: Si vous êtes sous Linux, vous installerez Python en utilisant le gestionnaire de paquets du système (``apt`` sur Debian/Ubuntu/Mint, ``dnf`` sur Fedora, ou ``pacman`` sur Arch).
pt: Se você estiver usando Linux, será necessário instalar o Python por meio do gerenciador de pacotes do sistema (`apt` no Debian/Ubuntu/Mint, `dnf` no Fedora, ou `pacman` no Arch).
zh_tw: 如果您使用的是 Linux，則會使用系統套件管理器（Debian/Ubuntu/Mint 上的 ``apt`` 、Fedora 上的 ``dnf`` 或 Arch 上的 ``pacman`` ）安裝 Python。

source: Support for Raspberry Pi is limited at this time.
de: Raspberry Pi wird derzeit nur begrenzt unterstützt.
es: La compatibilidad con Raspberry Pi es limitada por el momento.
fr: La prise en charge du Raspberry Pi est limitée pour le moment.
pt: Para o Raspberry Pi, o suporte está limitado neste momento.
zh_tw: 目前對 Raspberry Pi 的支援有限。

source: **Important:** You *must* use the system Python provided by your operating system. Alternative Python installations (pyenv, Anaconda, manually compiled Python, etc.) will prevent you from successfully packaging your application for distribution in later steps of this tutorial.
de: **Wichtig:** Sie *müssen* das von Ihrem Betriebssystem bereitgestellte Python-System verwenden. Alternative Python-Installationen (pyenv, Anaconda, manuell kompiliertes Python usw.) verhindern, dass Sie Ihre Anwendung in späteren Schritten dieses Tutorials erfolgreich für die Verteilung verpacken können.

source: Install dependencies
de: Abhängigkeiten installieren
es: Instalar dependencias
fr: Installer les dépendances
pt: Instale as dependências
zh_tw: 安裝依賴項

source: Next, install the additional dependencies needed for your operating system:
de: Als Nächstes installieren Sie die zusätzlichen Abhängigkeiten, die für Ihr Betriebssystem erforderlich sind:
es: A continuación, instale las dependencias adicionales necesarias para su sistema operativo:
fr: Ensuite, installez les dépendances supplémentaires nécessaires à votre système d'exploitation :
pt: Em seguida, instale as dependências adicionais necessárias para o seu sistema operacional:
zh_tw: 接下來，安裝作業系統所需的其他依賴項：

source: Building BeeWare apps on macOS requires:
de: Die Erstellung von BeeWare-Anwendungen unter macOS erfordert:
es: Construir aplicaciones BeeWare en macOS requiere:
fr: La construction d'applications BeeWare sur macOS nécessite :
pt: Para criar aplicativos BeeWare no macOS, é necessário:
zh_tw: 在 macOS 上建立 BeeWare 應用程式需要：

source: **Git**, a version control system. This is included with Xcode or the command line developer tools, which you installed above. You may need to open Xcode for the first time in order for Git to work in your terminal session. If it still doesn't register that Git is installed, you may need to restart your terminal session.
de: **Git**, ein Versionskontrollsystem. Dies ist in Xcode oder den Befehlszeilen-Entwicklertools enthalten, die Sie oben installiert haben. Möglicherweise müssen Sie Xcode zum ersten Mal öffnen, damit Git in Ihrer Terminalsitzung funktioniert. Wenn immer noch nicht registriert wird, dass Git installiert ist, müssen Sie möglicherweise Ihre Terminalsitzung neu starten.
es: **Git**, un sistema de control de versiones. Se incluye con Xcode o con las herramientas de línea de comandos para desarrolladores, que instalaste más arriba. Puede que tengas que abrir Xcode por primera vez para que Git funcione en tu sesión de terminal. Si aún no se registra que Git está instalado, puede que tenga que reiniciar su sesión de terminal.

source: To support local development, you'll need to install some system packages. The list of packages required varies depending on your distribution:
de: Um die lokale Entwicklung zu unterstützen, müssen Sie einige Systempakete installieren. Die Liste der erforderlichen Pakete hängt von Ihrer Distribution ab:
es: Para soportar el desarrollo local, necesitarás instalar algunos paquetes del sistema. La lista de paquetes necesarios varía en función de tu distribución:
fr: Pour permettre le développement local, vous allez devoir installer certains paquets système. La liste des paquets requis varie en fonction de votre distribution :
pt: Para dar suporte ao desenvolvimento local, será necessário instalar alguns pacotes do sistema. A lista de pacotes necessários pode variar de acordo com a sua distribuição:
zh_tw: 為了支援本地開發，您需要安裝一些系統軟體包。所需的軟體包清單因您的發行版而異：

source: Building BeeWare apps on Windows requires:
de: Die Erstellung von BeeWare-Anwendungen unter Windows erfordert:
es: Construir aplicaciones BeeWare en Windows requiere:
fr: La création d'applications BeeWare sur Windows nécessite :
pt: Para criar aplicativos BeeWare no Windows, é necessário:
zh_tw: 在 Windows 上建立 BeeWare 應用程式需要：

source: **Git**, a version control system. You can download Git from from `git-scm.com <https://git-scm.com/downloads/>`__.
de: **Git**, ein Versionskontrollsystem. Sie können Git von `git-scm.com <https://git-scm.com/downloads/>`__ herunterladen.
es: **Git**, un sistema de control de versiones. Puede descargar Git desde `git-scm.com <https://git-scm.com/downloads/>`__.
fr: **Git**, un système de contrôle de version. Vous pouvez télécharger Git à partir de `git-scm.com <https://git-scm.com/downloads/>`__.
pt: **Git**, um sistema de controle de versão. Você pode baixar o Git em `git-scm.com <https://git-scm.com/downloads/>`__.
zh_tw: **Git** ，版本控制系統。您可以從 `git-scm.com <https://git-scm.com/downloads/>`__ 下載 Git。

source: After installing these tools, you should ensure you restart any terminal sessions. Windows will only expose newly installed tools terminals started *after* the install has completed.
de: Nach der Installation dieser Tools sollten Sie sicherstellen, dass Sie alle Terminalsitzungen neu starten. Windows zeigt neu installierte Tools nur auf Terminals an, die *nach* Abschluss der Installation gestartet wurden.
es: Después de instalar estas herramientas, debe asegurarse de reiniciar cualquier sesión de terminal. Windows sólo expondrá las herramientas recién instaladas a los terminales iniciados *después* de que se haya completado la instalación.
fr: Après avoir installé ces outils, assurez-vous de redémarrer toutes les sessions de terminal. Sous Windows, les nouveaux outils installés ne seront accessibles qu'aux terminaux démarrés *après* la fin de l'installation.
pt: Após instalar essas ferramentas, é importante reiniciar qualquer sessão de terminal. No Windows, apenas os terminais iniciados *após* a conclusão da instalação mostrarão as ferramentas recém-instaladas.
zh_tw: 安裝這些工具後，您應該確保重新啟動所有終端會話。 Windows 只會公開安裝完成 *之後* 啟動的新安裝的工具終端。

source: Set up a virtual environment
de: Einrichten einer virtuellen Umgebung
es: Crear un entorno virtual
fr: Mise en place d'un environnement virtuel
pt: Configurar um ambiente virtual
zh_tw: 設定虛擬環境

source: We're now going to create a virtual environment - a "sandbox" that we can use to isolate our work on this tutorial from our main Python installation. If we install packages into the virtual environment, our main Python installation (and any other Python projects on our computer) won't be affected. If we make a complete mess of our virtual environment, we'll be able to simply delete it and start again, without affecting any other Python project on our computer, and without the need to re-install Python.
de: Wir werden nun eine virtuelle Umgebung erstellen - eine "Sandbox", die wir verwenden können, um unsere Arbeit an diesem Tutorial von unserer Haupt-Python-Installation zu isolieren. Wenn wir Pakete in die virtuelle Umgebung installieren, wird unsere Haupt-Python-Installation (und alle anderen Python-Projekte auf unserem Computer) davon nicht betroffen sein. Wenn wir unsere virtuelle Umgebung komplett durcheinander bringen, können wir sie einfach löschen und neu beginnen, ohne dass andere Python-Projekte auf unserem Computer betroffen sind und ohne dass wir Python neu installieren müssen.
es: Ahora vamos a crear un entorno virtual - una "caja de arena" que podemos utilizar para aislar nuestro trabajo en este tutorial de nuestra instalación principal de Python. Si instalamos paquetes en el entorno virtual, nuestra instalación principal de Python (y cualquier otro proyecto Python en nuestro ordenador) no se verá afectado. Si hacemos un completo desastre de nuestro entorno virtual, podremos simplemente borrarlo y empezar de nuevo, sin afectar a ningún otro proyecto Python en nuestro ordenador, y sin necesidad de reinstalar Python.
fr: Nous allons maintenant créer un environnement virtuel – un "bac à sable" (sandbox) que nous pouvons utiliser pour isoler notre travail sur ce tutoriel de notre installation Python principale. Si nous installons des paquets dans l'environnement virtuel, notre installation principale de Python (et tout autre projet Python sur notre ordinateur) ne sera pas affectée. Si nous provoquons un désordre complet dans notre environnement virtuel, nous pourrons simplement l'effacer et recommencer, sans affecter aucun autre projet Python sur notre ordinateur, et sans avoir besoin de réinstaller Python.
pt: Agora vamos criar um ambiente virtual - uma "sandbox" que podemos usar para isolar nosso trabalho neste tutorial de nossa instalação principal do Python. Se instalarmos pacotes no ambiente virtual, nossa instalação principal do Python (e qualquer outro projeto Python em nosso computador) não será afetada. Se bagunçarmos completamente nosso ambiente virtual, podemos simplesmente excluí-lo e começar novamente, sem afetar nenhum outro projeto Python em nosso computador e sem a necessidade de reinstalar o Python.
zh_tw: 現在，我們將創建一個虛擬環境 - 一個 `沙箱` ，我們可以使用它來將本教程的工作與主 Python 安裝隔離。如果我們將套件安裝到虛擬環境中，我們的主要 Python 安裝（以及我們電腦上的任何其他 Python 專案）將不會受到影響。如果我們把虛擬環境弄得一團糟，我們只需刪除它並重新開始，就不會影響我們電腦上的任何其他 Python 項目，也不需要重新安裝 Python。

source: If you're not using Python 3.12, replace the ``-3.12`` in these instructions with the version number that you are using.
de: Wenn Sie nicht Python 3.12 verwenden, ersetzen Sie das ``-3.12`` in dieser Anleitung durch die Versionsnummer, die Sie verwenden.

source: Errors running PowerShell Scripts
de: Fehler bei der Ausführung von PowerShell-Skripten
es: Errores al ejecutar scripts PowerShell
fr: Erreurs lors de l'exécution de scripts PowerShell
pt: Erros ao executar scripts do PowerShell
zh_tw: 執行 PowerShell 腳本時發生錯誤

source: If you're using PowerShell, and you receive the error::
de: Wenn Sie PowerShell verwenden und die folgende Fehlermeldung erhalten::
es: Si está utilizando PowerShell y recibe el error::
fr: Si vous utilisez PowerShell et que vous recevez l'erreur :
pt: Se você estiver usando o PowerShell e receber o erro:
zh_tw: 如果您使用 PowerShell，並且收到錯誤::

source: Your Windows account doesn't have permissions to run scripts. To fix this:
de: Ihr Windows-Konto hat keine Berechtigung zum Ausführen von Skripten. So beheben Sie dies:
es: Tu cuenta de Windows no tiene permisos para ejecutar scripts. Para solucionarlo:
fr: Votre compte Windows n'a pas les autorisations nécessaires pour exécuter des scripts. Pour y remédier :
pt: Sua conta do Windows não possui permissões para executar scripts. Para corrigir isso:
zh_tw: 您的 Windows 帳戶沒有執行腳本的權限。要解決此問題：

source: Run `Windows PowerShell as Administrator <https://learn.microsoft.com/en-us/powershell/scripting/windows-powershell/starting-windows-powershell?view=powershell-7.4>`_.
de: Führen Sie `Windows Powershell als Administrator aus <https://learn.microsoft.com/en-us/powershell/scripting/windows-powershell/starting-windows-powershell?view=powershell-7.4>`_.
es: Ejecute `Windows PowerShell como administrador <https://learn.microsoft.com/en-us/powershell/scripting/windows-powershell/starting-windows-powershell?view=powershell-7.4>`_.

source: Run ``set-executionpolicy RemoteSigned``
de: Führen Sie ``set-executionpolicy RemoteSigned`` aus
es: Ejecuta ``set-executionpolicy RemoteSigned``
fr: Exécutez ``set-executionpolicy RemoteSigned``
pt: Execute ``set-executionpolicy RemoteSigned``
zh_tw: 運行 ``set-executionpolicy RemoteSigned``

source: Select ``Y`` to change the execution policy.
de: Wählen Sie ``Y``, um die Ausführungspolitik zu ändern.
es: Seleccione ``Y`` para cambiar la política de ejecución.
fr: Sélectionnez "O" pour modifier la politique d'exécution.
pt: Selecione ``Y`` para alterar a política de execução.
zh_tw: 選擇 ``Y`` 更改執行策略。

source: Once you've done this you can rerun ``beeware-venv\Scripts\activate.ps1`` in your original PowerShell session (or a new session in the same directory).
de: Danach können Sie ``beeware-venv\Scripts\activate.ps1`` in Ihrer ursprünglichen PowerShell-Sitzung (oder in einer neuen Sitzung im selben Verzeichnis) erneut ausführen.
es: Una vez hecho esto, puede volver a ejecutar ``beeware-venv\Scripts\activate.ps1`` en su sesión PowerShell original (o en una nueva sesión en el mismo directorio).
fr: Une fois que vous avez fait cela, vous pouvez exécuter à nouveau ``beeware-venv\Scripts\activate.ps1`` dans votre session PowerShell d'origine (ou dans une nouvelle session dans le même répertoire).
pt: Depois de fazer isso, você pode executar novamente o comando ``beeware-venv\Scripts\activate.ps1`` na mesma janela do PowerShell em que você fez as alterações nas permissões (a janela original) ou em uma nova janela do PowerShell no mesmo diretório.
zh_tw: 完成此操作後，您可以在原始 PowerShell 會話（或同一目錄中的新會話）中重新執行 ``beeware-venv\Scripts\activate.ps1`` 。

source: If this worked, your prompt should now be changed - it should have a ``(beeware-venv)`` prefix. This lets you know that you're currently in your BeeWare virtual environment. Whenever you're working on this tutorial, you should make sure your virtual environment is activated. If it isn't, re-run the last command (the ``activate`` command) to re-activate your environment.
de: Wenn dies geklappt hat, sollte Ihre Eingabeaufforderung nun geändert sein - sie sollte ein ``(beeware-venv)``-Präfix haben. Dies zeigt Ihnen, dass Sie sich gerade in Ihrer virtuellen BeeWare-Umgebung befinden. Wann immer Sie an diesem Tutorial arbeiten, sollten Sie sicherstellen, dass Ihre virtuelle Umgebung aktiviert ist. Ist dies nicht der Fall, führen Sie den letzten Befehl (den Befehl ``activate``) erneut aus, um Ihre Umgebung wieder zu aktivieren.
es: Si esto ha funcionado, tu prompt debería haber cambiado - debería tener un prefijo ``(beeware-venv)``. Esto te permite saber que estás actualmente en tu entorno virtual BeeWare. Siempre que estés trabajando en este tutorial, debes asegurarte de que tu entorno virtual está activado. Si no lo está, vuelve a ejecutar el último comando (el comando ``activate``) para reactivar tu entorno.
fr: Si cela a fonctionné, votre prompt devrait maintenant être modifié – il devrait avoir un préfixe ``(beeware-venv)``. Cela vous permet de savoir que vous êtes actuellement dans votre environnement virtuel BeeWare. Chaque fois que vous travaillerez sur ce tutoriel, vous devrez vous assurer que votre environnement virtuel est activé. Si ce n'est pas le cas, relancez la dernière commande (la commande ``activate``) pour réactiver votre environnement.
pt: Se isso funcionou, seu prompt deve estar diferente agora - ele deve ter um prefixo ``(beeware-venv)``. Isso indica que você está atualmente no seu ambiente virtual BeeWare. Sempre que estiver trabalhando neste tutorial, certifique-se de que seu ambiente virtual esteja ativado. Se não estiver, execute novamente o último comando (o comando ``activate``) para reativar seu ambiente.
zh_tw: 如果這有效，你的提示現在應該改變 - 它應該有一個 ``(beeware-venv)`` 前綴。這可以讓您知道您目前處於 BeeWare 虛擬環境。每當您學習本教學時，您都應該確保您的虛擬環境已啟動。如果不是，請重新執行最後一個命令（ ``activate`` 命令）以啟動您的虛擬環境。

source: Alternative virtual environments
de: Alternative virtuelle Umgebungen
es: Entornos virtuales alternativos
fr: Environnements virtuels alternatifs
pt: Ambientes virtuais alternativos
zh_tw: 替代的虛擬環境

source: If you're using Anaconda or miniconda, you may be more familiar with using conda environments. You might also have heard of ``virtualenv``, a predecessor to Python's built in ``venv`` module. As with Python installs - if you're on macOS or Windows, it doesn't matter *how* you create your virtual environment, as long as you have one. If you're on Linux, you should stick to ``venv`` and the system Python.
de: Wenn Sie Anaconda oder miniconda benutzen, sind Sie vielleicht mehr mit der Verwendung von conda-Umgebungen vertraut. Vielleicht haben Sie auch schon von ``virtualenv`` gehört, einem Vorgänger von Pythons eingebautem ``venv`` Modul. Wie bei Python-Installationen ist es unter macOS oder Windows egal, *wie* Sie Ihre virtuelle Umgebung erstellen, solange Sie eine haben. Wenn Sie unter Linux arbeiten, sollten Sie sich an ``venv`` und das System-Python halten.
es: Si estás usando Anaconda o miniconda, puede que estés más familiarizado con el uso de entornos conda. También puedes haber oído hablar de ``virtualenv``, un predecesor del módulo ``venv`` de Python. Al igual que con las instalaciones de Python - si estás en macOS o Windows, no importa *cómo* creas tu entorno virtual, siempre y cuando tengas uno. Si estás en Linux, deberías usar ``venv`` y el sistema Python.
fr: Si vous utilisez Anaconda ou miniconda, vous êtes peut-être plus familier avec l'utilisation des environnements conda. Vous avez peut-être aussi entendu parler de ``virtualenv``, un prédécesseur du module intégré ``venv`` de Python. De même pour les installations de Python – si vous êtes sous macOS ou Windows, peu importe *comment* vous créez votre environnement virtuel, tant que vous en avez un. Si vous êtes sous Linux, vous devriez vous en tenir à ``venv`` et au Python du système.
pt: Caso esteja usando o Anaconda ou Miniconda, você pode estar mais familiarizado com o uso de ambientes conda. Você também deve ter ouvido falar do ``virtualenv``, um antecessor do módulo ``venv`` integrado ao Python. Da mesma forma que as instalações do Python - se você estiver no macOS ou Windows, não importa *como* você cria seu ambiente virtual, desde que tenha um. Se estiver no Linux, é recomendado usar o ``venv`` e o Python do sistema.
zh_tw: 如果您使用 Anaconda 或 miniconda，您可能會更熟悉使用 conda 環境。您可能也聽說過 ``virtualenv`` ，它是 Python 內建的 ``venv`` 模組的前身。與 Python 安裝一樣 - 如果您使用的是 macOS 或 Windows，只要您有一個虛擬環境， *如何* 建立虛擬環境並不重要。如果您使用的是 Linux，則應該堅持使用 ``venv`` 和系統 Python。

source: Next steps
de: Nächste Schritte
es: Siguientes pasos
fr: Étapes suivantes
pt: Próximos passos
zh_tw: 下一步

source: We've now set up our environment. We're ready to :doc:`create our first BeeWare application <tutorial-1>`.
de: Wir haben jetzt unsere Umgebung eingerichtet. Wir sind bereit, :doc:`unsere erste BeeWare-Anwendung zu erstellen <tutorial-1>`.
es: Ya hemos configurado nuestro entorno. Estamos listos para :doc:`crear nuestra primera aplicación BeeWare <tutorial-1>`.
fr: Nous avons maintenant mis en place notre environnement. Nous sommes prêts à :doc:`créer notre première application BeeWare <tutorial-1>`.
pt: Agora que configuramos nosso ambiente, estamos prontos para :doc:`criar nossa primeira aplicação BeeWare <tutorial-1>`.
zh_tw: 我們現在已經設定好了我們的環境。我們準備好 :doc:`創建我們的第一個 BeeWare 應用程式<tutorial-1>`。
